var data = {
  "A": [
    {
      "q": "Архитектурой ЭВМ называется - ",
      "a1": "Совокупность общих принципов организации аппаратно-программных средств и их основных характеристик.",
      "a2": "Один поток команд с несколькими потоками данных.",
      "a3": "Последовательности операций над парами элементов данных.",
      "a4": "Концепция проектирования процессоров",
      "a5": "Небольшое число регистров, каждый из которых выполняет строго определённую функцию",
      "k": "1"
    },
    {
      "q": "Алгоритмы сортировки не оцениваются",
      "a1": "По скорости выполнения ",
      "a2": "По эффективности использования памяти",
      "a3": "По устойчивости",
      "a4": "По производительности",
      "a5": "Верны 3 и 4",
      "k": "5"
    },
    {
      "q": "Матричный процессор – это",
      "a1": "Состоит из большого числа сходных процессоров, которые выполняют одну и ту же последовательность команд применительно к разным наборам данных",
      "a2": "Все операции сложения выполняются в одном блоке суммирования, который имеет конвейерную структуру",
      "a3": "Небольшое число регистров, каждый из которых выполняет строго определённую функцию",
      "a4": "Способ организации вычислений, используемый в современных процессорах и контроллерах с целью повышения их производительности",
      "a5": "Один поток команд с несколькими потоками данных",
      "k": "1"
    },
    {
      "q": "Векторный процессор – это",
      "a1": "Все операции сложения выполняются в одном блоке суммирования, который имеет   конвейерную структуру",
      "a2": "Состоит из большого числа сходных процессоров, которые выполняют одну и ту же последовательность команд применительно к разным наборам данных",
      "a3": "Небольшое число регистров, каждый из которых выполняет строго определённую функцию",
      "a4": "Способ организации вычислений, используемый в современных процессорах и контроллерах с целью повышения их производительности",
      "a5": "Один поток команд с несколькими потоками данных.",
      "k": "1"
    },
    {
      "q": "Если массив является неупорядоченным, то единственный алгоритм поиска, применимый в этом случае",
      "a1": "Поиск в ширину",
      "a2": "Бинарный поиск",
      "a3": "Алгоритм над целыми числами",
      "a4": "Последовательный поиск",
      "a5": "Поиск пути",
      "k": "4"
    },
    {
      "q": "Программа или сервис операционной системы, которая запускает другие программы в зависимости от различных критериев",
      "a1": "Диспетчер служб",
      "a2": "Планировщик задач",
      "a3": "Дефрагментатор",
      "a4": "Реестр",
      "a5": "Модуль отладки",
      "k": "2"
    },
    {
      "q": "Режим обработки данных, при котором обеспечивается взаимодействие вычислительной системы с внешними по отношению к ней процессами в темпе, соизмеримом со скоростью протекания этих процессов",
      "a1": "Гибернации",
      "a2": "Перезагрузки",
      "a3": "Ожидания",
      "a4": "Реального времени",
      "a5": "Включения",
      "k": "4"
    },
    {
      "q": "Методы решения оптимизационной задачи с ограничением, основанные на движении из одной допустимой точки в другую с улучшением значения целевой функции, называются",
      "a1": "Итерационными",
      "a2": "Двойственными",
      "a3": "Эквивалентными",
      "a4": "Трансвычислительными",
      "a5": "Ни что из выше перечисленного",
      "k": "1"
    },
    {
      "q": "Выберите метод, который не является методом нелинейной минимизации",
      "a1": "Метод Фибоначчи",
      "a2": "Симплек-метод",
      "a3": "Метод деления пополам",
      "a4": "Метод Ньютона",
      "a5": "Метод возможных направлений",
      "k": "2"
    },
    {
      "q": "Задачу линейного программирования в произвольной форме размерности n>2, можно решить графически",
      "a1": "После приведения задачи к канонической форме, с  условием n-m>2 (n-число неизвестных, m- число уравнений задачи)",
      "a2": "После приведения задачи к канонической форме, с условием n-m ≥2 (n-число неизвестных, m- число уравнений задачи)",
      "a3": "После приведения задачи к канонической форме, с  условием n-m≤2 (n-число неизвестных, m- число уравнений задачи)",
      "a4": "После приведения задачи к канонической форме, с  условием n+m>2 (n-число неизвестных, m- число уравнений задачи)",
      "a5": "После приведения задачи к канонической форме, с  условием n+m<2 (n-число неизвестных, m- число уравнений задачи)",
      "k": "3"
    },
    {
      "q": "Математический аппарат, разработанный для эффективного пошагового  решения задач оптимизации, называется",
      "a1": "Динамическое программирование",
      "a2": "Линейное программирование",
      "a3": "Нелинейное программирование",
      "a4": "Условная оптимизация",
      "a5": "Безусловная оптимизация",
      "k": "1"
    },
    {
      "q": "В какую область оперативной памяти СУБД переносит данные после завершения формирования результата запроса",
      "a1": "Область СУБД",
      "a2": "Область операционной системы",
      "a3": "Область прикладной программы ",
      "a4": "Область файла подкачки",
      "a5": "Область системных утилит",
      "k": "3"
    },
    {
      "q": "Операция декартового произведения имеет свойство",
      "a1": "Транзитивности",
      "a2": "Сюръективности",
      "a3": "Биективности",
      "a4": "Коммутативности",
      "a5": "Нет верного ответа",
      "k": "4"
    },
    {
      "q": "В чем заключается теорема Декарта",
      "a1": "Число положительных корней полинома равно числу перемен знаков в системе его коэффициентов или меньше этого числа на четную величину",
      "a2": "Число положительных корней полинома равно числу перемен знаков в системе его коэффициентов или меньше этого числа на не четную величину",
      "a3": "Из отсутствия перемен знаков следует отсутствие отрицательных корней уравнения",
      "a4": "Из отсутствия перемен знаков следует отсутствие положительных корней уравнения",
      "a5": "Между любыми двумя корнями многочлена f лежит корень его производной",
      "k": "1"
    },
    {
      "q": "Граф называется планарным если",
      "a1": "Он изоморфен некоторому плоскому графу",
      "a2": "Сумма его вершин и граней больше количества вершин",
      "a3": "Каждая пара вершин смежна",
      "a4": "Степень любой его вершины больше 3",
      "a5": "Число его граней меньше 2",
      "k": "1"
    },
    {
      "q": "Граф является лесом, когда",
      "a1": "Содержит 2 цикла",
      "a2": "Содержит 1 цикл",
      "a3": "Содержит более 1 цикла",
      "a4": "Не имеет циклов",
      "a5": "Содержит более 2 циклов",
      "k": "4"
    },
    {
      "q": "Общее решение дифференциального уравнения второго порядка представляет собой",
      "a1": "Множество интегральных кривых ",
      "a2": "Одну интегральную кривую, проходящую через точку (x0,y0)",
      "a3": "Решение, полученное методом Бернулли",
      "a4": "Решение, полученное симплекс-методом",
      "a5": "Решение, полученное с помощью метода вариации произвольной постоянной",
      "k": "1"
    },
    {
      "q": "Общее решение неоднородной системы представляет собой",
      "a1": "Произведение общего решения, соответствующего однородной системы и частотного решения неоднородной системы",
      "a2": "Сумму общего решения, соответствующего однородной системы и частотного решения неоднородной системы ",
      "a3": "Частное общего решения, соответствующего однородной системы и частотного решения неоднородной системы",
      "a4": "Частное решения неоднородной системы",
      "a5": "Решение, соответствующее однородной системе",
      "k": "2"
    },
    {
      "q": "Каким методом нельзя решить систему линейных неоднородных дифференциальных уравнений",
      "a1": "Методом неопределенных коэффициентов",
      "a2": "Методом вариации произвольных  постоянных",
      "a3": "Методом исключения",
      "a4": "Симплекс-методом ",
      "a5": "Методом Лагранжа",
      "k": "3"
    },
    {
      "q": "Какой из перечисленных методов можно применить к решению системы линейных неоднородных дифференциальных уравнений",
      "a1": "Симплекс-метод",
      "a2": "Метод Гомори",
      "a3": "Метод Гаусса",
      "a4": "Метод Крамера",
      "a5": "Метод вариации постоянных ",
      "k": "5"
    },
    {
      "q": "Что из перечисленного не относится к методам решения многомерной оптимизационной задачи",
      "a1": "Метод возможных направлений",
      "a2": "Метод деления пополам",
      "a3": "Метод проекции градиента Розена",
      "a4": "Метод ветвей и границ",
      "a5": "Симплекс-метод",
      "k": "2"
    },
    {
      "q": "Ведущий элемент в симплекс-методе не может быть",
      "a1": "Отрицательным",
      "a2": "Положительным",
      "a3": "Нулем",
      "a4": " Больше единицы",
      "a5": "Находиться в промежутке от 0 до 1",
      "k": "3"
    },
    {
      "q": "Метод Гомори относится к группе методов",
      "a1": "Отсечения",
      "a2": "Стохастические",
      "a3": "Второго порядка",
      "a4": "Динамического программирования",
      "a5": "Метрические",
      "k": "1"
    },
    {
      "q": "В основе метода Гомори лежит",
      "a1": "Симплекс-метод",
      "a2": "Метод потенциалов",
      "a3": "Метод Ньютона",
      "a4": "Двойственный симплекс-метод",
      "a5": "Метод ветвей и границ",
      "k": "1"
    },
    {
      "q": "Транспортная задача — это",
      "a1": "Задача для поиска кратчайшего пути в сети",
      "a2": "Задача отыскания гамильтонова контура в сети",
      "a3": "Задача о максимальном потоке в сети",
      "a4": "Задача линейного программирования специального вида о поиске оптимального распределения  однородных ресурсов из пунктов запаса в пункты потребления",
      "a5": "Задача о минимальном потоке в сети",
      "k": "4"
    },
    {
      "q": "Матричная игра – это антагонистическая игра, в которой обязательно выполняется одно из требований",
      "a1": "Оба игрока не имеют стратегий",
      "a2": "Оба игрока имеют одно и то же число стратегий",
      "a3": "Оба игрока имеют конечное число чистых стратегий",
      "a4": "Хотя бы один игрок имеет стратеги",
      "a5": "Оба игрока имеют не ограниченное число чистых стратегий",
      "k": "3"
    },
    {
      "q": "Языковые средства для работы с базой данных это",
      "a1": "Язык описания данных и язык манипулирования данными ",
      "a2": " Язык создания данных и язык журналирования данных",
      "a3": "Язык журналирования данных",
      "a4": "Оба варианта верны",
      "a5": "Оба варианта неверны",
      "k": "1"
    },
    {
      "q": "Язык описания данных предназначен для",
      "a1": "Формирования схем данных в прикладной программе",
      "a2": "Формирования внешних схем, глобального логического и физического описаний",
      "a3": "Оптимизации схем данных",
      "a4": "Денормализации схем данных",
      "a5": "Поиска многозначных зависимостей между отношениями",
      "k": "2"
    },
    {
      "q": "Язык манипулирования данными предназначен для",
      "a1": "Формирования запросов к операционной системе",
      "a2": "Формирования запросов к прикладной программе",
      "a3": "Формирования запросов к системным службам",
      "a4": "Формирования запросов к удаленным жестким дискам",
      "a5": "Формирования запросов к базе данных",
      "k": "5"
    },
    {
      "q": "Согласно формальной оптимизации операция проекции должна выполняться раньше операции",
      "a1": "Селекции",
      "a2": "Другой проекции",
      "a3": "Декартового произведения",
      "a4": "Соединения",
      "a5": "Декартового произведения и селекции",
      "k": "4"
    },
    {
      "q": "Согласно формальной оптимизации операции проекции и селекции должны выполняться",
      "a1": "Сначала проекция, затем селекция",
      "a2": "Сначала селекция, затем проекция",
      "a3": "Позже операции декартового соединения",
      "a4": "Позже операции естественного соединения",
      "a5": "Одновременно",
      "k": "5"
    },
    {
      "q": "Хеширование и индексный метод доступа являются",
      "a1": "Прямыми методами доступа ",
      "a2": "Последовательными методами доступа",
      "a3": "Методом доступа по неключевым атрибутам",
      "a4": "Параллельными методами доступ",
      "a5": "Нет верного ответа",
      "k": "1"
    },
    {
      "q": "Основным признаком последовательного доступа является то, что",
      "a1": " Очередная запись может быть прочитана, когда прочитаны все записи, следующие за ней",
      "a2": "Очередная запись может быть прочитана только тогда, когда прочитаны все предыдущие",
      "a3": "Запись может быть прочитана без предварительного чтения других записей",
      "a4": "Запись может быть прочитана при  предварительном хешировании предыдущих записей",
      "a5": "Нет верного ответа",
      "k": "2"
    },
    {
      "q": "При аппаратной реализации индексно-последовательного доступа блок индексного файла помещается в",
      "a1": "Нижнюю дорожку диска",
      "a2": "Каждую дорожку диска",
      "a3": "Верхнюю дорожку диска",
      "a4": "Выборочно на одну дорожку",
      "a5": "Нет верного ответа",
      "k": "3"
    },
    {
      "q": "Файл для индексно-последовательного метода доступа имеет",
      "a1": "Структуру стека",
      "a2": "Структуру очереди",
      "a3": "Двунаправленного списка",
      "a4": "Двустороннего стека",
      "a5": "Блочную структуру ",
      "k": "5"
    },
    {
      "q": "Выбрать способ реализации языка описания данных и языка манипулирования данными",
      "a1": "Независимо от СУБД и языков программирования ",
      "a2": "Независимо от прикладной программы, но зависит от СУБД",
      "a3": "Независимо от языков программирования",
      "a4": "Независимо от операционной системы",
      "a5": "Нет верного ответа",
      "k": "1"
    },
    {
      "q": "При реализации ЯОД и ЯМД в виде дополнения к языку программирования выделяют",
      "a1": "Реализацию в виде драйвера для операционной системы",
      "a2": "Реализацию в виде подпрограмм и в виде расширения синтаксиса языка программирования",
      "a3": "Реализацию в виде службы операционной системы",
      "a4": "Реализацию в виде системной утилиты операционной системы",
      "a5": "Нет верного ответа",
      "k": "2"
    },
    {
      "q": "При реализации ЯОД и ЯМД в виде снабжения СУБД встроенным языком программирования",
      "a1": "Язык дополняется традиционными операторами ",
      "a2": "Из языка удаляются некоторые операторы",
      "a3": "В языке изменяют выполнение некоторых операторов",
      "a4": "Язык наделяют функциональной парадигмой",
      "a5": "Нет верного ответа",
      "k": "1"
    },
    {
      "q": "Выбрать способ, не являющийся реализацией языка описания данных и языка манипулирования данными",
      "a1": "Независимо от прикладной программы, но зависимо от СУБД",
      "a2": "Независимо от СУБД и языков программирования",
      "a3": "Снабжение СУБД встроенным языком программирования",
      "a4": "Снабжение СУБД скриптовым языком программирования",
      "a5": "Нет верного ответа",
      "k": "1"
    },
    {
      "q": "Алгоритмы нахождения наибольшего общего делителя (НОД) двух чисел",
      "a1": "Алгоритм выбора",
      "a2": "Алгоритм Дейкстры",
      "a3": "Алгоритм Евклида",
      "a4": "Алгоритм Прима",
      "a5": "Алгоритм Флери",
      "k": "3"
    },
    {
      "q": "Последовательный перебор элементов структуры данных от начального элемента до нахождения совпадения или до конца структуры данных относится к поиску",
      "a1": "Бинарный поиск",
      "a2": "Интерполяционный поиск",
      "a3": "Линейный поиск",
      "a4": "Поиск в ширину",
      "a5": "Поиск пути",
      "k": "3"
    },
    {
      "q": "Алгоритм поиска элемента в отсортированном массиве, использующий дробление массива на половины",
      "a1": "Двоичный поиск",
      "a2": "Линейный поиск",
      "a3": "Интерполяционный поиск",
      "a4": "Поиск в ширину",
      "a5": "Поиск пути",
      "k": "1"
    },
    {
      "q": "В дереве, каждая вершина которого может иметь левого и правого потомка; каждая вершина, кроме корня имеет предка, называется",
      "a1": "T-дерево",
      "a2": "Красно-чёрное дерево",
      "a3": "АА-дерево",
      "a4": "Деревом двоичного поиска",
      "a5": "R-дерево",
      "k": "4"
    },
    {
      "q": "Таблица, где как столбцы, так и строки соответствуют вершинам графа. В каждой ячейке записывается число, определяющее наличие связи от вершины-строки к вершине-столбцу, называется",
      "a1": "Матрица инцидентности",
      "a2": "Матрица смежности",
      "a3": "Вариативная матриц",
      "a4": "Матрица линейного оператора",
      "a5": "Нулевая матрица",
      "k": "2"
    },
    {
      "q": "Элемент списка дуг состоит",
      "a1": "Из поля данных и двух указателей",
      "a2": "Из поля данных",
      "a3": "Из двух указателей",
      "a4": "Из двух полей данных и одного указателя",
      "a5": "Из поля данных и указателя на следующий элемент",
      "k": "3"
    },
    {
      "q": "Алгоритм поиска, при котором  для каждой непройденной вершины необходимо найти все непройденные смежные вершины и повторить поиск для них",
      "a1": "Поиск в ширину",
      "a2": "Поиск поэлементно",
      "a3": "Бинарный поиск",
      "a4": "Поиск в глубину",
      "a5": "Последовательный поиск",
      "k": "4"
    },
    {
      "q": "Общий метод нахождения решений задачи, в которой требуется полный перебор всех возможных вариантов в некотором множестве М называется",
      "a1": "Поиск пути",
      "a2": "Поиск с возвратом",
      "a3": " Метод проб и ошибок",
      "a4": "Информативный метод",
      "a5": "Бинарный поиск",
      "k": "2"
    },
    {
      "q": "В чем заключается метод «разделяй и властвуй»",
      "a1": "Заключающийся в рекурсивном разбиении решаемой задачи на одну подзадачу",
      "a2": "Заключается в поиске верхних и нижних границ для решения задачи на подобласти допустимых значений переменной х",
      "a3": "Заключается в поиске верхних и нижних границ на пустой подобласти",
      "a4": "Заключается в переборе всех возможных значений на допустимой подобласти",
      "a5": "Заключающийся в рекурсивном разбиении решаемой задачи на две или более подзадачи того же типа",
      "k": "5"
    },
    {
      "q": "Для какого анализа характерна максимальная затрата времени для любых  входных данных размера n",
      "a1": "Анализ среднего случая",
      "a2": "Анализ наилучшего случая",
      "a3": "Анализ наихудшего случая",
      "a4": "Анализ оптимального случая",
      "a5": "Верного варианта нет",
      "k": "3"
    },
    {
      "q": "Класс сложности – это",
      "a1": "Множества предикатов, использующих для вычисления примерно одинаковые количества ресурсов",
      "a2": "Функция, получающая на вход слово и возвращающая ответ 0 или 1",
      "a3": "Это зависимость количества массовых операций от объема обрабатываемых данных",
      "a4": "Набор инструкций, описывающих порядок действий исполнителя для достижения результата решения задачи за конечное число действий",
      "a5": "Операция мысленного или реального расчленения целого на составные части",
      "k": "1"
    },
    {
      "q": "Метод секущих является",
      "a1": " Одношаговым методом",
      "a2": "Двухшаговым методом",
      "a3": "Трехшаговым методом",
      "a4": "Четырехшаговым методом",
      "a5": "Простым методом",
      "k": "2"
    },
    {
      "q": "Метод касательных служит для",
      "a1": "Нахождение экстремума",
      "a2": "Вычисление производной",
      "a3": "Вычисление определенного интеграла",
      "a4": "Решение систем линейных уравнений",
      "a5": "Решения нелинейного уравнения",
      "k": "5"
    },
    {
      "q": " В чем заключается теорема Декарта",
      "a1": "Любыми двумя корнями многочлена f лежит корень его производной",
      "a2": "Из отсутствия перемен знаков следует отсутствие положительных корней уравнения",
      "a3": "Из отсутствия перемен знаков следует отсутствие отрицательных корней уравнения",
      "a4": "Число положительных корней полинома равно числу перемен знаков в системе его коэффициентов или меньше этого числа на четную величину",
      "a5": "Число положительных корней полинома равно числу перемен знаков в системе его коэффициентов или меньше этого числа на не четную величину",
      "k": "4"
    },
    {
      "q": "Массив, компонентами которого являются массивы,  называется",
      "a1": "Ассоциативный",
      "a2": "Множественный",
      "a3": "Многомерный",
      "a4": "Двойной",
      "a5": "Массивный",
      "k": "3"
    },
    {
      "q": "Принципы объектно-ориентированного представления программных систем",
      "a1": "Абстракция; модульность; динамичность",
      "a2": "Абстракция; инкапсуляция; наследование; полиморфизм",
      "a3": "Абстракция; инкапсуляция; статичность",
      "a4": "Инкапсуляция, полиморфизм, постоянство",
      "a5": "Инкапсуляция, полиморфизм, изменчивость",
      "k": "2"
    },
    {
      "q": "Что такое полиморфизм",
      "a1": "Свойство языка программирования, позволяющее единообразно обрабатывать данные разных типов",
      "a2": "Механизм языка программирования, ограничивающий доступ к составляющим объект компонентам (методам и свойствам), делает их приватными, то есть доступными только внутри объекта",
      "a3": "Механизм языка, позволяющий описать новый класс на основе уже существующего (родительского, базового) класса",
      "a4": "Программный инструмент, изменяющий код программы для последующей компиляции и сборки, используемый в языках программирования Си и его потомка - C++.",
      "a5": "Формальная знаковая система, предназначенная для записи компьютерных программ",
      "k": "1"
    },
    {
      "q": "Что такое инкапсуляция",
      "a1": "Свойство языка программирования, позволяющее единообразно обрабатывать данные разных типов",
      "a2": "Механизм языка программирования, ограничивающий доступ к составляющим объект компонентам (методам и свойствам), делает их приватными, то есть доступными только внутри объекта",
      "a3": "Механизм языка, позволяющий описать новый класс на основе уже существующего (родительского, базового) класса",
      "a4": "Программный инструмент, изменяющий код программы для последующей компиляции и сборки, используемый в языках программирования Си и его потомка - C++",
      "a5": "Формальная знаковая система, предназначенная для записи компьютерных программ",
      "k": "2"
    },
    {
      "q": "Что такое наследование",
      "a1": "Свойство языка программирования, позволяющее единообразно обрабатывать данные разных типов",
      "a2": "Механизм языка программирования, ограничивающий доступ к составляющим объект компонентам (методам и свойствам), делает их приватными, то есть доступными только внутри объекта",
      "a3": "Механизм языка, позволяющий описать новый класс на основе уже существующего (родительского, базового) класса",
      "a4": "Программный инструмент, изменяющий код программы для последующей компиляции и сборки, используемый в языках программирования Си и его потомка - C++",
      "a5": "Формальная знаковая система, предназначенная для записи компьютерных программ",
      "k": "3"
    },
    {
      "q": "Какой из перечисленных типов данных не является типом данных в С++",
      "a1": "real",
      "a2": "float",
      "a3": "int",
      "a4": "char",
      "a5": "double",
      "k": "1"
    },
    {
      "q": "Простые типы данных в С++",
      "a1": "целые – int, символьные – char, вещественные – float или real",
      "a2": "целые – int, символьные – char, вещественные – float или double",
      "a3": "целые – bool, символьные – string,  вещественные – float или double",
      "a4": "целые – int, символьные – float, вещественные – char",
      "a5": "целые – string, символьные – bool,  вещественные – float",
      "k": "2"
    },
    {
      "q": "Для чего используется переменные типа сhar",
      "a1": "Для представления символьных значений ",
      "a2": "Для представления числовых значений",
      "a3": "Для представления логических значений",
      "a4": "Для представления строк",
      "a5": "Для представления чисел с плавающей запятой",
      "k": "1"
    },
    {
      "q": "Какой тип данных используют для хранения вещественных чисел с двойной точностью",
      "a1": "double",
      "a2": "float",
      "a3": "int",
      "a4": "char",
      "a5": "   bool",
      "k": "1"
    },
    {
      "q": "При определении структуры необходимо использовать  ключевое слово",
      "a1": "object",
      "a2": "struct",
      "a3": "union",
      "a4": "procedure",
      "a5": "function",
      "k": "2"
    },
    {
      "q": "При определении объединения необходимо использовать ключевое слово",
      "a1": "object",
      "a2": "struct",
      "a3": "union",
      "a4": "procedure",
      "a5": "function",
      "k": "3"
    },
    {
      "q": "Какое значение должен возвращать деструктор",
      "a1": "Указатель на класс",
      "a2": "Объект класса",
      "a3": "Деструкторы не возвращают значение",
      "a4": "  int",
      "a5": "char",
      "k": "3"
    },
    {
      "q": "Какой спецификатор доступа в классах существует",
      "a1": "protected",
      "a2": "hidden",
      "a3": "dark",
      "a4": "shadow",
      "a5": "  thief",
      "k": "1"
    },
    {
      "q": "Какой модификатор доступа предоставляет минимальные права",
      "a1": "private",
      "a2": "protected",
      "a3": "public",
      "a4": "hidden",
      "a5": "old",
      "k": "1"
    },
    {
      "q": "В библиотеке C++ для ввода файлов существует класс ",
      "a1": "ofstream",
      "a2": "ifstream",
      "a3": "stream",
      "a4": "cin",
      "a5": "cout",
      "k": "2"
    },
    {
      "q": "В библиотеке C++ для вывода файлов существует класс",
      "a1": "ofstream",
      "a2": "ifstream",
      "a3": "stream",
      "a4": "cin",
      "a5": "cout",
      "k": "1"
    },
    {
      "q": "Функция для записи строки в файл",
      "a1": "fgets",
      "a2": "fopen",
      "a3": "fputs",
      "a4": "printf",
      "a5": "cout",
      "k": "3"
    },
    {
      "q": "Функция для чтения строки из файла",
      "a1": "fputs",
      "a2": "fgets",
      "a3": "fopen",
      "a4": "cin",
      "a5": "scanf",
      "k": "2"
    },
    {
      "q": "Условный оператор в языке С++",
      "a1": "   for",
      "a2": "while",
      "a3": "while do",
      "a4": "foreach",
      "a5": "if",
      "k": "5"
    },
    {
      "q": "Оператор цикла в языке C++",
      "a1": "if",
      "a2": "   for",
      "a3": "switch",
      "a4": "break",
      "a5": "case",
      "k": "2"
    },
    {
      "q": "Какая из записей возвращает значение переменной a, хранящееся в памяти по адресу, на который указывает указатель",
      "a1": "*a",
      "a2": "val(a)",
      "a3": "&a",
      "a4": "(a)",
      "a5": "{a}",
      "k": "1"
    },
    {
      "q": "Ключевое слово для динамического выделения памяти",
      "a1": "value",
      "a2": "create",
      "a3": "new ",
      "a4": "first",
      "a5": "make",
      "k": "3"
    },
    {
      "q": "Ключевое слово для высвобождения выделенной памяти",
      "a1": "free",
      "a2": "delete",
      "a3": "clear",
      "a4": "destroy",
      "a5": "annihilation",
      "k": "2"
    },
    {
      "q": "Какую функцию должны содержать все программы на С++",
      "a1": "main()",
      "a2": "program()",
      "a3": "system()",
      "a4": "begin()",
      "a5": "new()",
      "k": "1"
    },
    {
      "q": "Для чего применяется директива препроцессора # include",
      "a1": "Для организации цикла",
      "a2": "Для объявления функций",
      "a3": "Для включения в текст программы содержимого указанного файла",
      "a4": "Для объявления процедур",
      "a5": "Для объявления структур",
      "k": "3"
    },
    {
      "q": "Какая директива определяет идентификатор и последовательность символов, которой будет замещаться данный идентификатор при его обнаружении в тексте программы",
      "a1": "#define",
      "a2": "#include",
      "a3": "#undef",
      "a4": "# ifdef",
      "a5": "# ifndef",
      "k": "1"
    },
    {
      "q": "Тип планирования, который принимает решения о планировании не во время работы системы, а заранее",
      "a1": "Статический",
      "a2": "Динамический",
      "a3": "Стохастический",
      "a4": "Иерархический",
      "a5": "Эмпирический",
      "k": "1"
    },
    {
      "q": "Понятие, которому соответствует своя независимая от других область памяти, таблица открытых файлов, текущая директория и другая информация уровня ядра",
      "a1": "Нить",
      "a2": "Точка",
      "a3": "Кэш",
      "a4": "Ярлык",
      "a5": "Процесс",
      "k": "5"
    },
    {
      "q": "Когда могут быть предотвращены тупики",
      "a1": "На стадии выполнения программы",
      "a2": "На стадии разработки программы",
      "a3": "При выключении программы",
      "a4": "При проектировании программы",
      "a5": "При компиляции программы",
      "k": "1"
    },
    {
      "q": "Режим обработки данных, при котором обеспечивается взаимодействие вычислительной системы с внешними по отношению к ней процессами в темпе, соизмеримом со скоростью протекания этих процессов",
      "a1": "Ожидания",
      "a2": "Гибернации",
      "a3": "Включения",
      "a4": "Реального времени",
      "a5": "Перезагрузки",
      "k": "4"
    },
    {
      "q": "Планировщики, которые не используют никаких предположений о мультипрограммной смеси",
      "a1": "Статические",
      "a2": "Динамические",
      "a3": "Стохастические",
      "a4": "Подпрограммные",
      "a5": "Дискретные",
      "k": "2"
    },
    {
      "q": "Программа или сервис операционной системы, которая запускает другие программы в зависимости от различных критериев",
      "a1": "Диспетчер служб",
      "a2": "Дефрагментатор",
      "a3": "Планировщик задач",
      "a4": "Реестр",
      "a5": "Модуль отладки",
      "k": "3"
    },
    {
      "q": "Какой классификации планировщика не существует",
      "a1": "Статический",
      "a2": "Вытесняющий",
      "a3": "Невытесняющий",
      "a4": "Динамический",
      "a5": "Статистический",
      "k": "5"
    },
    {
      "q": "Какое из решений относится к долгосрочному планированию",
      "a1": "Какую из поступивших программ следует поставить в очередь на обслуживание",
      "a2": "Загружать ли в ОЗУ задачу",
      "a3": "Какой задаче предоставить ресурс процессора",
      "a4": "Когда предоставить ресурс процессора",
      "a5": "Следует ли ставить программу в очередь на предоставление ресурса процессора",
      "k": "1"
    },
    {
      "q": "CISC-компьютеры – это",
      "a1": "Управляющая логика микросхем  функционирует на уровне отдельных команд",
      "a2": "Состоит из большого числа сходных процессоров, которые выполняют одну и ту же последовательность команд применительно к разным наборам данных",
      "a3": "Все операции сложения выполняются в одном блоке суммирования, который имеет   конвейерную структуру",
      "a4": "В микросхемах множество низкоуровневых команд объединяют и одну для создания одного программного модуля, встроенного в управляющую логику микросхемы",
      "a5": "Способ организации вычислений, используемый в современных процессорах и контроллерах с целью повышения их производительности",
      "k": "4"
    },
    {
      "q": "RISC-компьютеры – эт",
      "a1": "В микросхемах множество низкоуровневых команд объединяют и одну для создания одного программного модуля, встроенного в управляющую логику микросхемы",
      "a2": "Способ организации вычислений, используемый в современных процессорах и контроллерах с целью повышения их производительности",
      "a3": "Состоит из большого числа сходных процессоров, которые выполняют одну и ту же последовательность команд применительно к разным наборам данных",
      "a4": "Управляющая логика микросхем  функционирует на уровне отдельных команд",
      "a5": "Все операции сложения выполняются в одном блоке суммирования, который имеет   конвейерную структуру",
      "k": "4"
    },
    {
      "q": "Конвейер команд – это",
      "a1": "Способ организации вычислений, используемый в современных процессорах и контроллерах с целью повышения их производительности",
      "a2": "Память, разделенная на ряд модулей или банков для осуществления одновременного доступа",
      "a3": "Последовательное или параллельное логическое устройство, используемое для хранения n-разрядных двоичных чисел и выполнения преобразований над ними",
      "a4": "Промежуточный буфер с быстрым доступом, содержащий информацию, которая может быть запрошена с наибольшей вероятностью",
      "a5": "Машинные команды выполняются аппаратными средствами не непосредственно, а путем интерпретации их а последовательность более простых действий",
      "k": "1"
    },
    {
      "q": "Регистры – это",
      "a1": "Способ организации вычислений, используемый в современных процессорах и контроллерах с целью повышения их производительности",
      "a2": "Память, разделенная на ряд модулей или банков для осуществления одновременного доступа",
      "a3": "Последовательное или параллельное логическое устройство, используемое для хранения n-разрядных двоичных чисел и выполнения преобразований над ними",
      "a4": "Промежуточный буфер с быстрым доступом, содержащий информацию, которая может быть запрошена с наибольшей вероятностью",
      "a5": "Машинные команды выполняются аппаратными средствами не непосредственно, а путем интерпретации их а последовательность более простых действий",
      "k": "3"
    },
    {
      "q": "Кэш-память – это",
      "a1": "Последовательное или параллельное логическое устройство, используемое для хранения n-разрядных двоичных чисел и выполнения преобразований над ними",
      "a2": "Промежуточный буфер с быстрым доступом, содержащий информацию, которая может быть запрошена с наибольшей вероятностью",
      "a3": "Способ организации вычислений, используемый в современных процессорах и контроллерах с целью повышения их производительности",
      "a4": "Машинные команды выполняются аппаратными средствами не непосредственно, а путем интерпретации их а последовательность более простых действий",
      "a5": "Память, разделенная на ряд модулей или банков для осуществления одновременного доступа",
      "k": "2"
    },
    {
      "q": "Микропрограммный уровень – это",
      "a1": "Память, разделенная на ряд модулей или банков для осуществления одновременного доступа",
      "a2": "Способ организации вычислений, используемый в современных процессорах и контроллерах с целью повышения их производительности",
      "a3": "Последовательное или параллельное логическое устройство, используемое для хранения n-разрядных двоичных чисел и выполнения преобразований над ними",
      "a4": "Промежуточный буфер с быстрым доступом, содержащий информацию, которая может быть запрошена с наибольшей вероятностью",
      "a5": "Машинные команды выполняются аппаратными средствами не непосредственно, а путем интерпретации их а последовательность более простых действий",
      "k": "5"
    },
    {
      "q": "Расслоенная память",
      "a1": "Память, разделенная на ряд модулей или банков для осуществления одновременного доступа",
      "a2": "Способ организации вычислений, используемый в современных процессорах и контроллерах с целью повышения их производительности",
      "a3": "Последовательное или параллельное логическое устройство, используемое для хранения n-разрядных двоичных чисел и выполнения преобразований над ними",
      "a4": "Промежуточный буфер с быстрым доступом, содержащий информацию, которая может быть запрошена с наибольшей вероятностью",
      "a5": "Машинные команды выполняются аппаратными средствами не непосредственно, а путем интерпретации их а последовательность более простых действий",
      "k": "1"
    },
    {
      "q": "Численное дифференцирование это",
      "a1": "Вычисление значения определённого интеграла",
      "a2": " Теория численных методов решения типовых математических задач",
      "a3": "Совокупность методов вычисления значения производной  функции",
      "a4": "Метод нахождения значений функции",
      "a5": "Вычисление значения неопределённого интеграла",
      "k": "3"
    },
    {
      "q": "Численное интегрирование это",
      "a1": "Теория численных методов решения задач",
      "a2": "Метод нахождения значений функции",
      "a3": "Совокупность методов вычисления значения производной  функции",
      "a4": "Вычисление значения неопределённого интеграла",
      "a5": "Вычисление значения определённого интеграла",
      "k": "5"
    },
    {
      "q": "Когда применяется численное интегрирование",
      "a1": "Когда необходимо вычислить производную функции",
      "a2": "Когда аналитическое представление подынтегральной функции известно, но её первообразная не выражается через аналитические функции",
      "a3": "Когда необходимо вычислить минимум функции",
      "a4": "Когда необходимо вычислить максимум функции",
      "a5": "Когда необходимо вычислить первообразную функции",
      "k": "2"
    },
    {
      "q": "Обыкновенные дифференциальные уравнения это",
      "a1": "Уравнения,  в которые входят  производные от искомой функции",
      "a2": "Уравнения, в которые входят  переменные в первой степени",
      "a3": "Уравнения, в которые входят  переменные во второй степени",
      "a4": "Уравнения, в которых не существует производных второго порядка",
      "a5": "Уравнения, в которые входят  первообразные",
      "k": "1"
    },
    {
      "q": "Задача Коши это",
      "a1": "Задача отыскания частного решения системы ОДУ на отрезке a ≤ x ≤ b, в которой дополнительные условия налагаются на значения функции uk(x) более чем в одной точке этого отрезка",
      "a2": "Когда задается начальная точка интегральной кривой ",
      "a3": "Когда в уравнение входят дополнительно m неизвестных параметров λ1, λ2, … λm",
      "a4": "Это задача отыскания частного решения системы ОДУ на отрезке a ≥ x ≥ b",
      "a5": "Это задача отыскания общего решения системы ОДУ на отрезке a ≤ x ≤ b",
      "k": "2"
    },
    {
      "q": "Краевая задача это",
      "a1": "Задача отыскания частного решения системы ОДУ на отрезке a ≤ x ≤ b, в которой дополнительные условия налагаются на значения функции uk(x) более чем в одной точке этого отрезка",
      "a2": "Когда в уравнение входят дополнительно m неизвестных параметров λ1, λ2, … λm",
      "a3": "Когда задается начальная точка интегральной кривой",
      "a4": "Это задача отыскания частного решения системы ОДУ на отрезке a ≥ x ≥ b",
      "a5": "Это задача отыскания общего решения системы ОДУ на отрезке a ≤ x",
      "k": "1"
    }
  ],
  "B": [
    {
      "q": "Хроматическое число любого планарного графа не превышает…Требование к ответу: записать в числовой форме.",
      "a": "4"
    },
    {
      "q": "Если граф не планарный, то он должен содержать больше 4 вершин, степень которых больше….Требование к ответу: записать в числовой форме.",
      "a": "3"
    },
    {
      "q": "Матрица контрдостижимости находится транспонированием матрицы…. Требование к ответу: Вставить пропущенное слово.",
      "a": "достижимости"
    },
    {
      "q": "Чему равно количество компонент связности в связном графе? Требование к ответу: записать в числовой форме.",
      "a": "1"
    },
    {
      "q": "Чему равна сумма компонент смешанной стратегии для матричной игры? Требование к ответу: записать в числовой форме.",
      "a": "1"
    },
    {
      "q": "Как называется память, разделенная на ряд модулей или банков для осуществления одновременного доступа? Требование к ответу: \"…..\" память. Вставить пропущенное слово.",
      "a": "расслоенная"
    },
    {
      "q": "Как называется тип планирования, который принимает решения о планировании не во время работы системы, а заранее? Требование к ответу:  \"…….\" тип. Записать пропущенное слово.",
      "a": "Статический"
    },
    {
      "q": "Как называется тип планирования, который не используют никаких предположений о мультипрограммной смеси?Требование к ответу:  \"…….\" тип. Записать пропущенное слово.",
      "a": "Динамический"
    },
    {
      "q": "Тип данных char в C++ используют для хранения … значений. Требование к ответу: Вставить пропущенное слово.",
      "a": "символьных"
    },
    {
      "q": "Тип данных short в C++ используют для хранения … значений.Требование к ответу: Вставить пропущенное слово.",
      "a": "целочисленных"
    },
    {
      "q": "Тип данных int в C++ используют для хранения … значений. Требование к ответу: Вставить пропущенное слово.",
      "a": "целочисленных"
    },
    {
      "q": "Тип данных double используют для хранения … чисел. Требование к ответу: Вставить пропущенное слово.",
      "a": "вещественных"
    },
    {
      "q": "Как называется массив, компонентами которого являются массивы? Требование к ответу: \"…..\" массив. Вставить пропущенное слово.",
      "a": "многомерный"
    },
    {
      "q": "Заявка на разговор, пришедшая в момент, когда все каналы связи заняты, получает отказ и покидает СМО необслуженной. О каком типе СМО идёт речь? Требование к ответу : СМО \"…….\". Вставить пропущенное слово, предлог и слово через пробел.",
      "a": " с отказами"
    },
    {
      "q": "Как называется тип процессора, который состоит из большого числа сходных процессоров, которые выполняют одну и ту же последовательность команд применительно к разным наборам данных? Требование к ответу: \"…..\" тип. Вставить пропущенное слово.",
      "a": "матричный"
    },
    {
      "q": "Как называется тип процессора, у которого все операции сложения выполняются в одном блоке суммирования, который имеет   конвейерную структуру? Требование к ответу: \"…..\" тип. Вставить пропущенное слово.",
      "a": "векторный"
    },
    {
      "q": "Как называется метод решения оптимизационной задачи, основанный на движении из одной допустимой точки в другую с улучшением значения целевой функции? Требование к ответу: \" ….\" метод. Записать пропущенное слово.",
      "a": "итерационный"
    },
    {
      "q": "Как называется последовательное или параллельное логическое устройство, используемое для хранения n-разрядных двоичных чисел и выполнения преобразований над ними? Требование к ответу: записать в именительном падеже , в единственном числе.",
      "a": "регистр"
    },
    {
      "q": "Как называется режим обработки данных, при котором обеспечивается взаимодействие вычислительной системы с внешними по отношению к ней процессами в темпе, соизмеримом со скоростью протекания этих процессов? Требование к ответу: Режим \"……..\". Вставить пропущенные слова через пробел.",
      "a": "Реального времени"
    },
    {
      "q": "Определить тип планирования для следующей задачи: \"Какую из поступивших программ следует поставить в очередь на обслуживание?\" Требование к ответу: \"……\" тип. Вставить пропущенное слово.",
      "a": "долгосрочный"
    },
    {
      "q": "Название алгоритма для упорядочения элементов в списке. Требование к ответу: Алгоритм \"…….\". Вставить пропущенное слово.",
      "a": "сортировки"
    },
    {
      "q": "Как называется алгоритм поиска, если массив является неупорядоченным? Требование к от ответу: \"……\" поиск. Вставить пропущенное слово. ",
      "a": "Последовательный"
    },
    {
      "q": "Как называется поиск для последовательного  перебора элементов структуры данных от начального элемента до нахождения совпадения или до конца структуры данных? Требование к от ответу: \"……\" поиск . Вставить пропущенное слово. ",
      "a": "линейный"
    },
    {
      "q": "Как называется алгоритм поиска элемента в отсортированном массиве, использующий дробление массива на половины? Требование к от ответу: \"……\" поиск. Вставить пропущенное слово. ",
      "a": "Двоичный"
    },
    {
      "q": "Алгоритм нахождения НОД двух чисел называют также алгоритмом...Требование к ответу: Вставить пропущенное слово.",
      "a": "Евклида"
    },
    {
      "q": "Как называется матрица, где как столбцы, так и строки соответствуют вершинам графа. В каждой ячейке записывается число, определяющее наличие связи от вершины-строки к вершине-столбцу. Требование к ответу: матрица \"……..\" .Вставить пропущенное слово.",
      "a": "смежности"
    },
    {
      "q": "Элемент списка дуг состоит из … указателей. Теребование к ответу: ответ в числовой форме",
      "a": "2"
    },
    {
      "q": "Как называется алгоритм поиска, при котором  для каждой непройденной вершины необходимо найти все непройденные смежные вершины и повторить поиск для них?Требование к ответу: поиск \"……\" Вставить пропущенные предлог и слово через пробел.",
      "a": " в глубину"
    },
    {
      "q": "Как называется общий метод нахождения решений задачи, в которой требуется полный перебор всех возможных вариантов в некотором множестве М? Требование к ответу: поиск \"…..\". Вставить пропущенные предлог и слово через пробел.",
      "a": "с возвратом"
    },
    {
      "q": "Как называется множества предикатов, использующих для вычисления примерно одинаковые количества ресурсов? Требование к ответу: класс \"….\". Вставить пропущенное слово.",
      "a": "сложности"
    },
    {
      "q": "Как называется орграф, если любые 2 вершины взаимно достижимы? Требование к ответу:    \"….\" орграф. Вставить пропущенное  слово.",
      "a": "сильносвязный"
    },
    {
      "q": "Сколько хорд  содержит каждый фундаментальный цикл ? Требование к ответу: записать в числовой форме",
      "a": "1"
    },
    {
      "q": "Граф является эйлеровым, если в нём отсутствуют вершины  ….. степени? Требование к ответу:  Вставить пропущенное слово.",
      "a": "нечетной"
    },
    {
      "q": "if - это \"…..\" оператор в языке С++. Требование к ответу: Вставить пропущенное (прилагательное).",
      "a": "условный "
    },
    {
      "q": "for - это оператор ... в языке C++. Требование к ответу: Вставить пропущенное слово в единственном числе, именительном падеже.",
      "a": "цикл"
    },
    {
      "q": "Какой оператор используется для перехода на следующую итерацию цикла в языке C++?",
      "a": "continue"
    },
    {
      "q": "Какой оператор  используется для прерывания циклических структур в языке С++?",
      "a": "break"
    },
    {
      "q": "Какое ключевое слово  используется  для динамического выделения памяти в языке С++?",
      "a": "new"
    },
    {
      "q": "Как называется свойство языка программирования, позволяющее единообразно обрабатывать данные разных типов? Требование к ответу: записать слово в единственном числе, в именительном падеже.",
      "a": "полиморфизм"
    },
    {
      "q": "Как называется механизм языка программирования, ограничивающий доступ к составляющим объект компонентам (методам и свойствам), делает их приватными, то есть доступными только внутри объекта? Требование к ответу: записать слово в единственном числе, в именительном падеже.",
      "a": "инкапсуляция"
    },
    {
      "q": "Как называется механизм языка, позволяющий описать новый класс на основе уже существующего (родительского, базового) класса? Требование к ответу: записать слово в единственном числе, в именительном падеже.",
      "a": "наследование"
    },
    {
      "q": "Что применяется, когда аналитическое представление подынтегральной функции известно, но её первообразная не выражается через аналитические функции? Требование к ответу: записать два слова через пробел.",
      "a": "численное интегрирование"
    },
    {
      "q": "Как называется задача, когда задается начальная точка интегральной кривой? Требование к ответу : Задача \"….\" Вставить пропущенное слово.",
      "a": "Коши"
    },
    {
      "q": "Как называется задача отыскания частного решения системы ОДУ на отрезке a ≤ x ≤ b, в которой дополнительные условия налагаются на значения функции uk(x) более чем в одной точке этого отрезка? Требование к ответу: \"…..\" задача. Вставить пропущенное слово.",
      "a": "Краевая"
    },
    {
      "q": "Как называется уровень, на котором машинные команды выполняются аппаратными средствами не непосредственно, а путем интерпретации их а последовательность более простых действий? Требование к ответу: \"……\" уровень. Вставить пропущенное слово.",
      "a": "микропрограммный"
    },
    {
      "q": "Как называется программа или сервис операционной системы, которая запускает другие программы в зависимости от различных критериев?  Требование к ответу: записать два слова через пробел в именительном падеже.",
      "a": "планировщик задач"
    },
    {
      "q": "Как называются задачи отыскания точек минимумов или максимумов функций на заданных множествах? Требование к ответу: задачи \"……\". Вставить пропущенное слово.",
      "a": "оптимизации"
    },
    {
      "q": " Как называются связь, если каждому значению факторного признака соответствует вполне определенное неслучайное значение результативного признака. Требование к ответу: \"…..\" связь. Вставить пропущенное слово.",
      "a": "корреляционная"
    },
    {
      "q": "Как называется мера разброса случайной величины, её отклонение от математического ожидания?",
      "a": "Дисперсия"
    },
    {
      "q": "Чему равна степень изолированной вершины графа? Требование к ответу: записать в числовой форме",
      "a": "0"
    },
    {
      "q": "Чему равна степень висячей вершины графа? Требование к ответу: записать в числовой форме",
      "a": "1"
    },
    {
      "q": " Как называется граф, каждому ребру которого поставлено в соответствие некое значение (вес). Требование к ответу: \"…..\" граф. Вставить пропущенное слово.",
      "a": "Взвешенный"
    },
    {
      "q": "Как называется неориентированный связный граф без циклов? Требование к ответу: записать в именительном падеже в единственном числе",
      "a": "дерево"
    },
    {
      "q": "Как называется неориентированный несвязный граф без циклов? Требование к ответу: записать в именительном падеже в единственном числе",
      "a": "лес"
    },
    {
      "q": "Как называется ряд  у которого последовательность частичных сумм не имеет предела. Требование к ответу: \"….\" ряд. Вставить пропущенное слово.",
      "a": "расходящийся"
    },
    {
      "q": "Как называется математическое выражение, отражающее выбранный критерий эффективности функционирования исследуемой системы в её\r\nматематической модели. Требование к ответу: записать слова через пробел.",
      "a": "Целевая функция"
    },
    {
      "q": "Как называется совокупность случайно отобранных из изучаемой совокупности объектов. Требование к ответу: записать в имениельном падеже в единственном числе",
      "a": "Выборка"
    }
  ]
}